#მონაცემთა ტიპების გარდაქმნა გვეხმარება ტქნიკაში 
 #მონაცემთა ტიპები არის string,integor და float 
 # #string არის ნებისმიერი რამ რაც ბრჭყალებში წერია 
 # integor არის ნებისმიერი მთელი რიცხვი 
 #  float არის ნებისმიერი 10 წილადი 








# debuging არის კოდში არსებული შეცდომების გასწორება.
# კონკადინაცია არის  ტექსტის შეერთება
# case sensitive არის დიდი და პატარა ასოები განსხვავდება.
# snake case არის როდესაც სიტყვები გამოყოფილი არის ქვედატირეთი.
# terminal არის ჩვენი დაწერილი კოდის შემოწმება.
# input არის შეტანა.
# output არის გამოტანა.