# true-გამოიტანს იმ შემთხვევაში თ კოდი სწორად გვექნება დაწერილი.ხოლო ფალე-გამოიტანს როცა არასწორად გვეწერება ჩვენი კოდი.
# and-ოპერატორს გამოიტანს როდესაც ყველა ერთდ უნდა გავაკეთოთ ხოლო or-ოპერატორს გამოიტანს როდესაც ან ერთს ვაკეთებთ ან მეორეს.

print (10>9 or 59>4 )# true
print (65>2 or 100>99)#true
print (9<2 or 10<2)#false


# and აბრუნებს true-ს მხოლოდ მაშინ როცა ორივე პირობა მართალია.
# or აბრუნებს true-ს მაშინ,როცა მინიმუმ ერთი პირობა მაინც მართალია.
# >-არის მეტობა
# <-არის ნაკლებობა
# ==-არის ტოლობა
# !=- ანუ არ უდრის
# >=- ანუ ტოლია ან მეტია
# <=- ანუ ნაკლებია ან ტოლია