# >-მეტობა
# <-ნაკლებობა 
# =-ტოლია
# !=-არ უდრის 
# >=-მეტია ან ტოლია
# <=-ნაკლებია ან ტოლია
# ამ ოპერატორების მეშვეობით ჩვენ შეგვიძლია შევადარით რიცხვი
# (true and false)#False
# (true or false)# true
# and ოპერატორი მხოლოდ მაშინ აბრუნებს true-ს როცა ყველა კოდი ჭეშმარიტია ხოლო false- როცა არასწორი კოდია.
# or ოპერატორი ის აბრუნებს true-ს თუ ერთი კოდი მაინც ჭეშმარიტია ხოლო false ოპერატორს როცა აბსოლუტურად ყველა პირობა მცდარია.



# algoritm-არის ნაბიჯ-ნაბიჯ მოცემული ინსტრუქცია.
# pseudecode- არ არის პროგრამირების ენა უბრალოდ მიახლოებულია, ის გვეხმარება წამოვადგინიოთ ალგორითმი
# flowchart-გვეხმარება რომ ვიჟუალად წარმოვადგინოთ ალგორითმები.
# sequencing-არის თანმიმდევრობა.
# ieration-არის გამეორება.
# selection-არის შერჩევა-არჩევა