# control flow ნიშნავს იმ ლოგიკურ გზას,რომელსაც კომპიუტერი გადის შენი კოდის კიტხვისას და შედგება სამი ნაწილისგან ესენია:sequence,iteration და selections.

# for ინდენტაცია არის დაშორება 
# for არის keyword რომლის საშუალებით პითონს ვანიშნებთ რომ უნდა შევქმნათ for loop ის შექმნა გვსურს.
# i არის საიტერაციო ცვლადი და ის ყოველს იტერაციაზე იცვლის მნიშვნელობას.
# in-ის საშვალებით ჩვენ შეგვიძლია პროგრამას ვუთხრათ სად უნდა ეძებოს i-ის თვის მნიშვნელობა.
# range-არის ფუნქცია რომლის საშუალებიტ ვქმნით ციფრების მიმდევრობას.
# range (10) შექმის 0 1 2 3 4 5 6 7 8 9 
# : ანიშნებს პითონს რომ for loop ის წერა დამთავრდება და ინდენტაცია რომელ ხაზზეც იქნება დაცული იქნება for loop ში მოთავსდება,ამ შემთხვევაში გამეორდება 10-ჯერ.
# print (i) ტერმინალში გამოიტანს i-ში რაც ინახება იქამდე სანამ for loop-ი იმუშავებს.
# for loop თითო იტერაციაზე i შენახული მნიშვნელობა იცვლება.
# for loop გვეხმარება კოდის გამეორებაში.

for i in range ("10"):
    print ("nikolozi")


