# algorithm -არის ნაბიჯ-ნაბიჯ მოცემული ინსტრუქცია.
# pseudocode - არ არის პროგრამირების ენა უბრალოდ მიახლოებულია, ის გვეხმარება წამოვადგინიოთ ალგორითმი.
# flowchart  -გვეხმარება რომ ვიჟუალად წარმოვადგინოთ ალგორითმები.
# sequencing-არის თანმიმდევრობა.
# iteration -არის გამეორება.
# selection - არის შერჩევა-არჩევა.

# control flow შედგება 3 ნაწილისგან.
# ჩვენ ალგორითმის წარმოდგენის გზა გვაქვს ოთხი მთავარი გზა.
# ალგორითმი არის - ნაბიჯ-ნაბიჯ მოცემული ინსტრუქცია.

# number = 1
# while number <= 10:
print ("number")
# number = number + 1