# 1)
grades = [91, 85, 60, 77, 98]

# 1. პირველი ნიშანი
print(grades[0])

# 2. მესამე ნიშანი
print(grades[2])

# 3. ბოლო ნიშანი
print(grades[-1])

# 4. ნიშნის შესწორება და სიის დაბეჭდვა
grades[3] = 82
print(grades)


# 2)
steps = [4500, 8000, 10200, 3100, 9000]

# 1. მეორე დღე
print(steps[1])

# 2. მეოთხე დღე
print(steps[3])

# 3. ბოლო დღე
print(steps[-1])

# 4. მონაცემის განახლება და სიის დაბეჭდვა
steps[0] = 5200
print(steps)


# 3)
prices = [15, 42, 9, 120, 35, 64]

# 1. პირველი პროდუქტი
print(prices[0])

# 2. მეოთხე პროდუქტი
print(prices[3])

# 3. ბოლო პროდუქტი
print(prices[-1])

# 4. ფასდაკლების ასახვა და სიის დაბეჭდვა
prices[2] = 7
print(prices)

# 4)
# List არის მონაცემთა სტრუქტურა, რომელიც საშუალებას გვაძლევს ერთ ცვლადში ბევრი სხვადასხვა ინფორმაცია შევინახოთ.
# Index არის თითოეული ელემენტის „მისამართი“ ან რიგითი ნომერი სიაში.